<?php

use frontend\helpers\PhoneHelper;
?>

<footer class="footer-container">
    <div class="container">
        <div class="footer-contacts">
            <a class="tel" href="tel:<?= PhoneHelper::format(\Yii::$app->params['supportPhone'], PhoneHelper::PHONE_FORMAT_FULL) ?>" data-toggle="modal" data-target="#callbackModal">
                <?= PhoneHelper::format(\Yii::$app->params['supportPhone'], PhoneHelper::PHONE_FORMAT_SHORT_PRINT) ?>
            </a>

            <span class="divider"></span>

            <a class="eml" href="mailto:<?= \Yii::$app->params['supportEmail'] ?>"><?= \Yii::$app->params['supportEmail'] ?></a>
        </div>

        <div class="footer-nav">
            <ul class="links">
                <li>
                    <a href="#">Доставка і оплата</a>
                </li>
                <li>
                    <a href="#">Обмін та повернення товару</a>
                </li>
                <li>
                    <a href="#">Партнерська програма</a>
                </li>
                <li>
                    <a href="#">Знижки!</a>
                </li>
            </ul>

            <div class="buttons">
                <a href="#">
                    <svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" width="16px" height="16px">
                        <path fill-rule="evenodd" fill="rgb(128, 128, 128)" d="M12.800,15.200 L3.200,15.200 C1.874,15.200 0.800,14.125 0.800,12.800 L0.800,3.200 C0.800,1.874 1.874,0.800 3.200,0.800 L12.800,0.800 C14.125,0.800 15.200,1.874 15.200,3.200 L15.200,12.800 C15.200,14.125 14.125,15.200 12.800,15.200 ZM8.000,4.400 C6.012,4.400 4.400,6.012 4.400,8.000 C4.400,9.988 6.012,11.600 8.000,11.600 C9.988,11.600 11.600,9.988 11.600,8.000 C11.600,6.012 9.988,4.400 8.000,4.400 ZM11.900,3.200 C11.403,3.200 11.000,3.603 11.000,4.100 C11.000,4.597 11.403,5.000 11.900,5.000 C12.397,5.000 12.800,4.597 12.800,4.100 C12.800,3.603 12.397,3.200 11.900,3.200 ZM8.000,10.400 C6.674,10.400 5.600,9.325 5.600,8.000 C5.600,6.674 6.674,5.600 8.000,5.600 C9.325,5.600 10.400,6.674 10.400,8.000 C10.400,9.325 9.325,10.400 8.000,10.400 Z"/>
                    </svg>
                </a>
                <a href="#">
                    <svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" width="18px" height="15px">
                        <path fill-rule="evenodd" fill="rgb(128, 128, 128)" d="M17.938,0.020 C17.426,-0.333 -0.006,6.327 -0.006,6.825 C-0.006,7.033 1.315,7.614 3.830,8.859 C4.661,9.274 4.661,9.274 5.002,10.145 C5.343,11.016 6.025,12.759 6.366,13.631 C6.685,14.502 6.685,14.502 7.197,14.025 C9.818,11.515 9.413,11.494 10.500,12.282 C13.334,14.336 14.570,15.083 14.698,15.000 C14.933,14.855 18.385,0.331 17.938,0.020 ZM8.412,8.381 C6.771,9.917 7.154,9.377 6.920,11.141 C6.877,11.411 6.835,11.618 6.771,11.597 C6.728,11.597 6.664,11.515 6.579,11.348 C6.366,10.871 5.940,9.647 5.748,9.045 C5.535,8.423 5.535,8.423 7.090,7.406 C16.723,1.119 16.787,0.559 8.412,8.381 Z"/>
                    </svg>
                </a>
                <a href="#">
                    <svg xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" width="10px" height="21px">
                        <path fill-rule="evenodd" fill="rgb(128, 128, 128)" d="M6.529,6.299 L6.529,4.619 C6.529,3.801 7.064,3.610 7.438,3.610 C7.814,3.610 9.746,3.610 9.746,3.610 L9.746,0.014 L6.569,-0.001 C3.042,-0.001 2.241,2.683 2.241,4.401 L2.241,6.299 L0.202,6.299 L0.202,10.500 L2.258,10.500 C2.258,15.260 2.258,21.000 2.258,21.000 L6.371,21.000 C6.371,21.000 6.371,15.201 6.371,10.500 L9.423,10.500 L9.798,6.299 L6.529,6.299 Z"/>
                    </svg>
                </a>
            </div>
        </div>
    </div>
</footer>